{"author":[],"actions":[],"created_at":"2020-09-10T11:44:35.060Z","updated_at":"2020-09-10T11:45:05.667Z","created_by":"elastic","description":"This detection rule flags when a domain is spotted in the certificate transparency fields, located in the Phishbeat index. Replace * with your domain in the query.","enabled":true,"false_positives":[],"filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"params":{"lt":"now","gte":"now-5m"},"type":"range","key":"@timestamp"},"range":{"@timestamp":{"lt":"now","gte":"now-5m"}}}],"from":"now-360s","id":"0f547385-664f-43d0-add9-a82f73927f51","immutable":false,"index":["phishbeat-*"],"interval":"5m","rule_id":"b8a7109f-3ef4-4bcb-a6f0-c4a6ab753fae","language":"kuery","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":0,"risk_score_mapping":[],"name":"Phishbeat - Certificate Transparency","query":"data.leaf_cert.all_domains: *","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://abc9f8363d8d4825a0805d15e24fec57.ap-southeast-2.aws.found.io:9243/app/security"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":["Phishbeat","Certificate Transparency","Stric"],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":2,"exceptions_list":[]}
